app/Controllers/ApplicationController.php

    public function admin_Add()
    {

        $data['password_length'] = 8; // Change this to your desired password length
        $data['password'] = random_string('alnum', $data['password_length']);

        $countryModel = new CountryModel();
        $data['countries'] = $countryModel->findAll();
---
SELECT *
FROM `countries`