app/Models/AgentModel.php

public function getAgentsByManagerTManagerCode($tmanager_manager_code) {
    // Get the database connection
    $db = $this->db;

    // Build the query using the query builder
    $query = $db->table('awall_agents')
                ->where('tmanager_code', $tmanager_manager_code)
                ->get();
---
SELECT *
FROM `awall_agents`
WHERE `tmanager_code` = 'TMNR05'

public function getAgentById($agent_id) {
    // Get the database connection
    $db = $this->db;

    // Build the query using the query builder
    $query = $db->table('awall_agents')
                ->where('a_id', $agent_id)
                ->get();
---
SELECT *
FROM `awall_agents`
WHERE `a_id` = '6'