app/Models/ApplicationModel.php

    public function  getshareholdersByAgentCode($agent_code) {


        // Get the database connection
        $db = $this->db;

        // Build the query using the query builder
        $query = $db->table('awall_applications')
                    ->where('referalcode', $agent_code)
                    ->get();
---
SELECT *
FROM `awall_applications`
WHERE `referalcode` = 'ADWA06'