app/Models/TertiarymModel.php

SELECT `country_name`
FROM `countries`
WHERE `country_id` = '0'
---
    public function getCountryNameById($country_id)
    {
        $query = $this->db->table('countries')->select('country_name')->where('country_id', $country_id)->get();

SELECT `state_name`
FROM `states`
WHERE `state_id` = '0'
---
    public function getStateNameById($state_id)
    {
        $query = $this->db->table('states')->select('state_name')->where('state_id', $state_id)->get();

SELECT `dist_name`
FROM `districts`
WHERE `dist_id` = '0'
---
    public function getDistrictNameById($district_id)
    {
        $query = $this->db->table('districts')->select('dist_name')->where('dist_id', $district_id)->get();

SELECT `city_name`
FROM `cities`
WHERE `city_id` = '0'
---
    public function getCityNameById($city_id)
    {
        $query = $this->db->table('cities')->select('city_name')->where('city_id', $city_id)->get();

SELECT *
FROM `tertiary_manager`
WHERE `manager_code` = 'MNR08'
---
    public function getTertiaryManagersByManagerManagerCode($manager_manager_code) {
        // Get the database connection
        $db = $this->db;

        // Build the query using the query builder
        $query = $db->table('tertiary_manager')
                    ->where('manager_code', $manager_manager_code)
                    ->get();

SELECT *
FROM `tertiary_manager`
WHERE `Tmanager_id` = '16'
---
    public function getTManagerById($tmanager_id) {
        // Get the database connection
        $db = $this->db;

        // Build the query using the query builder
        $query = $db->table('tertiary_manager')
                    ->where('Tmanager_id', $tmanager_id)
                    ->get();